# RebarBendingDetail Class

---
C#Visual BasicVisual C++
Revit 2024 API
---
RebarBendingDetail Class
Members See Also
---
Utility class with methods needed for the bending details in view.
**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2024
# Syntax
C#
---
```text
public static class RebarBendingDetail
```

Visual Basic
---
```text
Public NotInheritable Class RebarBendingDetail
```

Visual C++
---
```text
public ref class RebarBendingDetail abstract sealed
```

# Inheritance Hierarchy
System..::..Object Autodesk.Revit.DB.Structure..::..RebarBendingDetail
# See Also
RebarBendingDetail Members
Autodesk.Revit.DB.Structure Namespace